[К оглавлению](https://github.com/Musador13/Tinkoff-Contest/blob/main/README.md)

# Задача D. Бумажка с числами.

### Ограничение времени

- #### 1 секунда

### Ограничение памяти

- #### 256 МБ

---

Костя подключен к мобильному оператору «Мобайл». Абонентская плата Кости составляет _A_ рублей в месяц. За эту стоимость
Костя получает _B_ мегабайт интернет-трафика. Если Костя выйдет за лимит трафика, то каждый следующий мегабайт будет
стоить ему _C_ рублей. Костя планирует потратить _D_ мегабайт интернет-трафика в следующий месяц. Помогите ему
сосчитать, во сколько рублей ему обойдется интернет.

#### Формат входных данных
Вводится _4_ целых положительных числа _A,B,C,D(1≤A,B,C,D≤100)_ — стоимость
тарифа Кости, размер тарифа Кости, стоимость каждого лишнего мегабайта, размер интернет-трафика Кости в следующем
месяце. Числа во входном файле разделены пробелами.


#### Формат выходных данных
Выведите одно натуральное число — суммарные расходы Кости на интернет.


#### Замечание
В первом примере Костя сначала оплатит пакет интернета, после чего потратит на _55_ мегабайт больше, чем разрешено по
тарифу. Следовательно, за 55 мегабайт он дополняет отдельно, получившаяся стоимость
_100+12×5=160_ рублей.<br>
Во втором примере Костя укладывается в тарифный план, поэтому платит только за него.

## Примеры данных

### Пример 1

**Ввод**<br>
100 10 12 15<br>

**Вывод**<br>
160

### Пример 2

**Ввод**<br>
100 10 12 1<br>

**Вывод**<br>
100<br>

---

# **Решение**
````java
import java.util.ArrayList;
import java.util.Comparator;
import java.util.List;
import java.util.Scanner;

/**
 * Задача D. Бумажка с числами.
 */
public class Exercise4 {

    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        int n = scanner.nextInt();
        int k = scanner.nextInt();
        int[] arr = new int[n];
        List<Long> values = new ArrayList<>();

        for (int i = 0; i < n; i++) {
            arr[i] = scanner.nextInt();

            int weight = 1;

            while (arr[i] > 0) {
                int digit = arr[i] % 10;
                long gain = (long) (9 - digit) * weight;
                values.add(gain);
                weight *= 10;
                arr[i] /= 10;
            }
        }

        scanner.close();

        long afterSum = values.stream()
                .sorted(Comparator.reverseOrder())
                .limit(k)
                .reduce(0L, Long::sum);

        System.out.println(afterSum);
    }
}
