[К оглавлению](https://github.com/Musador13/Tinkoff-Contest/blob/f98d25c8971dab353140cdf52174f6424137ffb4/README.md)

# Задача A. Мобайл.

### Ограничение времени

- #### 1 секунда

### Ограничение памяти

- #### 256 МБ

---

Костя подключен к мобильному оператору «Мобайл». Абонентская плата Кости составляет _A_ рублей в месяц. За эту стоимость
Костя получает _B_ мегабайт интернет-трафика. Если Костя выйдет за лимит трафика, то каждый следующий мегабайт будет
стоить ему _C_ рублей. Костя планирует потратить _D_ мегабайт интернет-трафика в следующий месяц. Помогите ему
сосчитать, во сколько рублей ему обойдется интернет.

#### Формат входных данных
Вводится _4_ целых положительных числа _A,B,C,D(1≤A,B,C,D≤100)_ — стоимость
тарифа Кости, размер тарифа Кости, стоимость каждого лишнего мегабайта, размер интернет-трафика Кости в следующем
месяце. Числа во входном файле разделены пробелами.


#### Формат выходных данных
Выведите одно натуральное число — суммарные расходы Кости на интернет.


#### Замечание
В первом примере Костя сначала оплатит пакет интернета, после чего потратит на _55_ мегабайт больше, чем разрешено по
тарифу. Следовательно, за 55 мегабайт он дополняет отдельно, получившаяся стоимость
_100+12×5=160_ рублей.<br>
Во втором примере Костя укладывается в тарифный план, поэтому платит только за него.

## Примеры данных

### Пример 1

**Ввод**<br>
100 10 12 15<br>

**Вывод**<br>
160

### Пример 2

**Ввод**<br>
100 10 12 1<br>

**Вывод**<br>
100<br>

---

# **Решение**
````java
 // Задача A. Мобайл.
public class Exercise1 {

    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        int a, b, c, d;

        a = scanner.nextInt();
        b = scanner.nextInt();
        c = scanner.nextInt();
        d = scanner.nextInt();
        scanner.close();

        int sum;

        if (d <= b) {
            sum = a;
        } else {
            sum = a + ((d - b) * c);
        }

        System.out.println(sum);
    }
}
