[К оглавлению](https://github.com/Musador13/Tinkoff-Contest/blob/f98d25c8971dab353140cdf52174f6424137ffb4/README.md)

# Задача B. Рулет.

### Ограничение времени

- #### 1 секунда

### Ограничение памяти

- #### 256 МБ

---

Ваня принес на кухню рулет, который он хочет разделить с коллегами. Для этого он хочет
разрезать
рулет на _N_ равных
частей. Разумеется, рулет можно резать только поперек. Соотвественно,
Костя сделает _N_ - 1 разрез ножом через равные промежутки.

По возвращению с кофе-брейка Ваня задумался — а можно ли было обойтись меньшим числом
движений, будь нож Вани бесконечно длинным (иначе говоря, если он мог бы сделать
сколько угодно разрезов за раз, если эти разрезы лежат на одной прямой)?
Считается, что места для разрезов намечены заранее, и все разрезы делаются с ювелирной
точностью.

Оказывается, что можно. Например, если Ваня хотел бы разделить рулет на 4 части, он мог бы
обойтись двумя разрезами — сначала он разделил бы рулет на две половинки, а потом совместил
бы две половинки и разрезал обе пополам одновременно.

Вам дано число _N_, требуется сказать, каким минимальным числом разрезов можно обойтись.

#### Формат входных данных

Дано одно натуральное число _N_(1≤_N_≤2×10<sup>9</sup>) - количество людей на кофе-брейке.

#### Формат выходных данных

Выведите одно число — минимальное число движений, которое придется сделать Косте.

#### Замечание

Чтобы разрезать рулет на 6 частей, Ване сначала придется разрезать его на две равные части,
после чего совместить две половинки и сделать два разреза.

Чтобы разрезать рулет на 5 частей, Ване понадобится разделить его в соотношении 2:3, после
чего совместить два рулета по левому краю и разрезать бОльший рулет на одинарные
кусочки — меньший тоже разделится на одинарные.

## Примеры данных

### Пример 1

**Ввод**<br>
6<br>

**Вывод**<br>
3

### Пример 2

**Ввод**<br>
5<br>

**Вывод**<br>
3<br>

---

# **Решение**

````java
// Задача B. Рулет.
public class Exercise2 {

    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        int a = scanner.nextInt();

        System.out.println(bit1(a));

        scanner.close();
    }

    static int bit1(int x) {
        int k;

        if ((x & (x - 1)) == 0) {
            k = -1;
        } else {
            k = 0;
        }

        while (x != 0) {
            k++;
            x /= 2;
        }
        return k;
    }
}